dyes_list = {
        'Кумасси бриллиантовый синий': ['K', 'R', 'H'],
        'Окрашивание серебром': ['N', 'Q', 'C'],
        'Амидо черный': ['K', 'R', 'H'],
        'Бромфеноловый синий': ['K', 'R', 'H'],
        'Пирогаллоловый красный': ['K'],
        'Sypro Ruby': ['K', 'R', 'H'],
        'Stain-free': ['W'],
        'Zn-имидазольное негативное окрашивание': ['H', 'C', 'Q', 'N'],
        }

dyes_for_model = (
        ('Кумасси бриллиантовый синий', 'Кумасси бриллиантовый синий'),
        ('Окрашивание серебром', 'Окрашивание серебром'),
        ('Амидо черный', 'Амидо черный'),
        ('Бромфеноловый синий', 'Бромфеноловый синий'),
        ('Пирогаллоловый красный', 'Пирогаллоловый красный'),
        ('Sypro Ruby', 'Sypro Ruby'),
        ('Stain-free', 'Stain-free'),
        ('Zn-имидазольное негативное окрашивание', 'Zn-имидазольное негативное окрашивание'),
        )

a_replace = {
        'B': 'N',
        'Z': 'Q',
        'J': 'L',
        'X': '',
        }

aa_list = list('ACDEFGHIKLMNOPQRSTUVWY')
